docs/notes/emacs/elisp.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Elisp</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Elisp</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5ea681a">Association Lists</a></li>
<li><a href="#orgb5a26eb">Pretty Printing Objects</a>
<ul>
<li><a href="#org9669e1d">cl-prettyprint</a></li>
<li><a href="#orgdc12be1">pp</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-org5ea681a" class="outline-2">
<h2 id="org5ea681a"><a href="#org5ea681a">Association Lists</a></h2>
<div class="outline-text-2" id="text-org5ea681a">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>assoc <span style="color: #98be65;">"foo"</span> '<span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"foo"</span> . <span style="color: #98be65;">"bar"</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span><span style="color: #98be65;">"baz"</span> . <span style="color: #98be65;">"qux"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
(foo . bar)
</pre>


<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orge335a71">'<span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"cats"</span> . <span style="color: #98be65;">"hats"</span><span style="color: #c678dd;">)</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">"dogs"</span> . <span style="color: #98be65;">"hogs"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
((cats . hats) (dogs . hogs))
</pre>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span>assoc <span style="color: #98be65;">"cats"</span> mylist<span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
(cats . hats)
</pre>
</div>
</div>

<div id="outline-container-orgb5a26eb" class="outline-2">
<h2 id="orgb5a26eb"><a href="#orgb5a26eb">Pretty Printing Objects</a></h2>
<div class="outline-text-2" id="text-orgb5a26eb">
</div>
<div id="outline-container-org9669e1d" class="outline-3">
<h3 id="org9669e1d"><a href="#org9669e1d">cl-prettyprint</a></h3>
<div class="outline-text-3" id="text-org9669e1d">
<p>
<code>cl-prettyprint</code> formats nicely, but weirdly, it's not a function that
returns a string. Instead it literally inserts text into the buffer at point.
That can be ok in the scratch buffer, but otherwise useless IMO.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">     <span style="color: #51afef;">(</span><span style="color: #51afef;">let</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>my-string-alist '<span style="color: #a9a1e1;">(</span><span style="color: #4db5bd;">(</span><span style="color: #98be65;">"foo"</span> . <span style="color: #98be65;">"bar"</span><span style="color: #4db5bd;">)</span>
                              <span style="color: #4db5bd;">(</span><span style="color: #98be65;">"baz"</span> . <span style="color: #98be65;">"qux"</span><span style="color: #4db5bd;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
       <span style="color: #c678dd;">(</span>cl-prettyprint my-string-alist<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"foo"</span> . <span style="color: #98be65;">"bar"</span><span style="color: #c678dd;">)</span>
 <span style="color: #c678dd;">(</span><span style="color: #98be65;">"baz"</span> . <span style="color: #98be65;">"qux"</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

</pre>
</div>

<p>
We can wrap <code>cl-prettyprint</code> in a function to yank the string. Taken from
<a href="https://stackoverflow.com/a/3552347/340613">this SO answer</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">pprint</span> <span style="color: #c678dd;">(</span>form <span style="color: #ECBE7B;">&amp;optional</span> output-stream<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>princ <span style="color: #98be65;">(</span><span style="color: #51afef;">with-temp-buffer</span>
           <span style="color: #a9a1e1;">(</span>cl-prettyprint form<span style="color: #a9a1e1;">)</span>
           <span style="color: #a9a1e1;">(</span>buffer-string<span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
         output-stream<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
pprint
</pre>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">let</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>my-string-alist '<span style="color: #a9a1e1;">(</span><span style="color: #4db5bd;">(</span><span style="color: #98be65;">"foo"</span> . <span style="color: #98be65;">"bar"</span><span style="color: #4db5bd;">)</span>
                         <span style="color: #4db5bd;">(</span><span style="color: #98be65;">"baz"</span> . <span style="color: #98be65;">"qux"</span><span style="color: #4db5bd;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>pprint my-string-alist<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">

(("foo" . "bar")
 ("baz" . "qux"))
</pre>
</div>
</div>

<div id="outline-container-orgdc12be1" class="outline-3">
<h3 id="orgdc12be1"><a href="#orgdc12be1">pp</a></h3>
<div class="outline-text-3" id="text-orgdc12be1">
<p>
<code>pp</code> is great. But I noticed sometimes it doesn't format as vertically as
<code>cl-prettyprint</code> (example?).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">let</span> <span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span>my-string-alist '<span style="color: #a9a1e1;">(</span><span style="color: #4db5bd;">(</span><span style="color: #98be65;">"foo"</span> . <span style="color: #98be65;">"bar"</span><span style="color: #4db5bd;">)</span>
                         <span style="color: #4db5bd;">(</span><span style="color: #98be65;">"baz"</span> . <span style="color: #98be65;">"qux"</span><span style="color: #4db5bd;">)</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>pp my-string-alist<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<div class="results">#+RESULTS:</div><pre class="example">
(("foo" . "bar")
 ("baz" . "qux"))
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
